templates/inverse_barometer/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class volScalarField;
  object nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions[0 2 - 1 0 0 0 0]; // Turbulent viscosity [m^2/s]

internalField uniform 0; // Initialize to 0, will be calculated from k/omega

boundaryField {
  inlet {
    type calculated; // Derived from turbulence model
    value uniform 0;
  }

  outlet {
    type calculated;
    value uniform 0;
  }

  bottom { type symmetryPlane; }

  top {
    type calculated;
    value uniform 0;
  }

  side_left { type symmetryPlane; }

  side_right { type symmetryPlane; }
}

// ************************************************************************* //
