templates/inverse_barometer/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class dictionary;
  location "constant";
  object transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases(water air);

water {
  transportModel Newtonian;
  nu 1e-06; // Kinematic viscosity [m^2/s]
  rho 1025; // Density [kg/m^3]
}

air {
  transportModel Newtonian;
  nu 1.48e-05; // Kinematic viscosity [m^2/s]
  rho 1;       // Density [kg/m^3]
}

sigma 0.07; // Surface tension between water and air [N/m]

// ************************************************************************* //
